package com.example.quiz

object Constants {

    const val USER_NAME: String = "user_name"
    const val TOTAL_QUESTIONS: String = "total_questions"
    const val CORRECT_ANSWERS: String = "correct_answers"
    private val countriesCodes: ArrayList<String> = arrayListOf("ad", "ae", "af", "ag", "ai", "al", "am", "ao", "aq", "ar", "as", "at", "au", "aw", "ax", "az",
        "ba", "bb", "bd", "be", "bf", "bg", "bh", "bi", "bj", "bl", "bm", "bn", "bo", "bq", "br", "bs", "bt", "bv", "bw", "by", "bz",
        "ca", "cc", "cd", "cf", "cg", "ch", "ci", "ck", "cl", "cm", "cn", "co", "cr", "cu", "cv", "cw", "cx", "cy", "cz",
        "de", "dj", "dk", "dm", "dom", "dz", "ec", "ee", "eg", "eh", "er", "es", "et",
        "fi", "fj", "fk", "fm", "fo", "fr", "ga", "gb", "gd", "ge", "gf", "gg", "gh", "gi", "gl", "gm", "gn", "gp", "gq", "gr", "gs", "gt", "gu", "gw", "gy",
        "hk", "hm", "hn", "hr", "ht", "hu", "id", "ie", "il", "im", "in", "io", "iq", "ir", "is", "it", "je", "jm", "jo", "jp",
        "ke", "kg", "kh", "ki", "km", "kn", "kp", "kr", "kw", "ky", "kz", "la", "lb", "lc", "li", "lk", "lr", "ls", "lt", "lu", "lv", "ly",
        "ma", "mc", "md", "me", "mf", "mg", "mh", "mk", "ml", "mm", "mn", "mo", "mp", "mq", "mr", "ms", "mt", "mu", "mv", "mw", "mx", "my", "mz",
        "na", "nc", "ne", "nf", "ng", "ni", "nl", "no", "np", "nr", "nu", "nz", "om",
        "pa", "pe", "pf", "pg", "ph", "pk", "pl", "pm", "pn", "pr", "ps", "pt", "pw", "py", "qa",
        "re", "ro", "rs", "ru", "rw", "sa", "sb", "sc", "sd", "se", "sg", "sh", "si", "sj", "sk", "sl", "sm", "sn", "so", "sr", "ss", "st", "sv", "sx", "sy", "sz",
        "tc", "td", "tf", "tg", "th", "tj", "tk", "tl", "tm", "tn", "to", "tr", "tt", "tv", "tw", "tz",
        "ua", "ug", "um", "us", "uy", "uz", "va", "vc", "ve", "vg", "vi", "vn", "vu", "wf", "ws", "xk", "ye", "yt", "za", "zm", "zw")

//#region fun getQuestions(): ArrayList<Question>
//    fun getQuestions(): ArrayList<Question> {
//        val questionsList = ArrayList<Question>()
//
//        // 1
//        val que1 = Question(
//            1, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_argentina,
//            "Аргентина", "Австралия",
//            "Армения", "Австрия", 1
//        )
//
//        questionsList.add(que1)
//
//        // 2
//        val que2 = Question(
//            2, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_australia,
//            "Ангола", "Австрия",
//            "Австралия", "Армения", 3
//        )
//
//        questionsList.add(que2)
//
//        // 3
//        val que3 = Question(
//            3, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_brazil,
//            "Белорусь", "Белиз",
//            "Бруней", "Бразилия", 4
//        )
//
//        questionsList.add(que3)
//
//        // 4
//        val que4 = Question(
//            4, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_belgium,
//            "Багамы", "Бельгия",
//            "Барбадос", "Белиз", 2
//        )
//
//        questionsList.add(que4)
//
//        // 5
//        val que5 = Question(
//            5, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_fiji,
//            "Габон", "Франция",
//            "Фиджи", "Финляндия", 3
//        )
//
//        questionsList.add(que5)
//
//        // 6
//        val que6 = Question(
//            6, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_germany,
//            "Германия", "Грузия",
//            "Греция", "ни одна из перечисленных", 1
//        )
//
//        questionsList.add(que6)
//
//        // 7
//        val que7 = Question(
//            7, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_denmark,
//            "Доминика", "Египет",
//            "Дания", "Эфиопия", 3
//        )
//
//        questionsList.add(que7)
//
//        // 8
//        val que8 = Question(
//            8, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_india,
//            "Ирландия", "Иран",
//            "Венгрия", "Индия", 4
//        )
//
//        questionsList.add(que8)
//
//        // 9
//        val que9 = Question(
//            9, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_new_zealand,
//            "Австралия", "Новая Зеландия",
//            "Тувалу", "США", 2
//        )
//
//        questionsList.add(que9)
//
//        // 10
//        val que10 = Question(
//            10, "Какая страна принадлежит этому флагу?",
//            R.drawable.ic_flag_of_kuwait,
//            "Кувейт", "Иордания",
//            "Судан", "Палестина", 1
//        )
//
//        questionsList.add(que10)
//
//        return questionsList
//    }


//    fun getQuestions():ArrayList<Question>{
//        val questionsList = ArrayList<Question>(
//            listOf(
//            Question(1, "Какая страна принадлежит этому флагу?", R.drawable.ad, "Аргентина", "Андора", "Армения", "Австрия", 2),
//            Question(2, "Какая страна принадлежит этому флагу?", R.drawable.ae, "Объединенные Арабские Эмираты", "Австралия", "Бельгия", "Ангола", 1),
//            Question(3, "Какая страна принадлежит этому флагу?", R.drawable.af, "Афганистан", "Албания", "Ангола", "Австрия", 1),
////            Question(4, "Какая страна принадлежит этому флагу?", R.drawable.ag, "Ангилья", "Алжир", "Андора", "Антигуа и Барбуда", 4),
////            Question(5, "Какая страна принадлежит этому флагу?", R.drawable.ai, "Ангилья", "Албания", "Андора", "Антигуа и Барбуда", 1),
////            Question(6, "Какая страна принадлежит этому флагу?", R.drawable.al, "Албания", "Андора", "Ангилья", "Ангола", 3),
////            Question(7, "Какая страна принадлежит этому флагу?", R.drawable.am, "Армения", "Андора", "Ангилья", "Албания", 1),
////            Question(8, "Какая страна принадлежит этому флагу?", R.drawable.ao, "Ангола", "Албания", "Андора", "Афганистан", 1),
////            Question(9, "Какая страна принадлежит этому флагу?", R.drawable.aq, "Антарктида", "Андора", "Албания", "Ангилья", 1),
////            Question(10, "Какая страна принадлежит этому флагу?", R.drawable.ar, "Аргентина", "Андора", "Албания", "Анголья", 1),
////            Question(11, "Какая страна принадлежит этому флагу?", R.drawable.`as`, "Американское Самоа", "Андора", "Албания", "Ангилья", 1),
////            Question(12, "Какая страна принадлежит этому флагу?", R.drawable.at, "Германия", "Андора", "Австрия", "Ангилья", 3),
////            Question(13, "Какая страна принадлежит этому флагу?", R.drawable.au, "Бельгия", "Австралия", "Албания", "Ангилья", 2),
////            Question(14, "Какая страна принадлежит этому флагу?", R.drawable.aw, "Дания", "Аруба", "Албания", "Ангилья", 2),
////            Question(15, "Какая страна принадлежит этому флагу?", R.drawable.ax, "Великобритания", "Андора", "Аландские острова", "Ангилья", 3),
////            Question(16, "Какая страна принадлежит этому флагу?", R.drawable.az, "Азербайджан", "Албания", "Армения", "Австрия", 1),
////                Question(17, "Какая страна принадлежит этому флагу?", R.drawable.ba, "Босния и Герцеговина", "Италия", "Бангладеш", "Бельгия", 1),
////                Question(18, "Какая страна принадлежит этому флагу?", R.drawable.bb, "Барбадос", "Босния и Герцеговина", "Венгрия", "Бельгия", 1),
////                Question(19, "Какая страна принадлежит этому флагу?", R.drawable.bd, "Япония", "Италия", "Бангладеш", "Бельгия", 3),
////                Question(20, "Какая страна принадлежит этому флагу?", R.drawable.be, "Бельгия", "Бангладеш", "Италия", "Босния и Герцеговина", 1),
////                Question(21, "Какая страна принадлежит этому флагу?", R.drawable.bf, "Мозамбик", "Босния и Герцеговина", "Буркина-Фасо", "Италия", 3),
////                Question(22, "Какая страна принадлежит этому флагу?", R.drawable.bg, "Мексика", "Болгария", "Бангладеш", "Босния и Герцеговина", 2),
////                Question(23, "Какая страна принадлежит этому флагу?", R.drawable.bh, "Индонезия", "Босния и Герцеговина", "Бангладеш", "Бахрейн", 4),
////                Question(24, "Какая страна принадлежит этому флагу?", R.drawable.bi, "Бурунди", "Италия", "Гватемала", "Бельгия", 1),
////                Question(25, "Какая страна принадлежит этому флагу?", R.drawable.bj, "Еквадор", "Бенин", "Франция", "Босния и Герцеговина", 2),
////                Question(26, "Какая страна принадлежит этому флагу?", R.drawable.bl, "Сен-Бартельми", "Италия", "Гватемала", "Бельгия", 1),
////                Question(27, "Какая страна принадлежит этому флагу?", R.drawable.bm, "Румуния", "Италия", "Франция", "Бермуды", 4),
////                Question(28, "Какая страна принадлежит этому флагу?", R.drawable.bn, "Мазомбик", "Белорусь", "Бруней", "Бельгия", 3),
////                Question(29, "Какая страна принадлежит этому флагу?", R.drawable.bo, "Боливия", "Финляндия", "Франция", "Босния и Герцеговина", 1),
////                Question(30, "Какая страна принадлежит этому флагу?", R.drawable.bq, "Македония", "Белорусь", "Карибские Нидерланды", "Бельгия", 3),
////                Question(31, "Какая страна принадлежит этому флагу?", R.drawable.br, "Испания", "Дания", "Бразилия", "Бразилия", 4),
////                Question(32, "Какая страна принадлежит этому флагу?", R.drawable.bs, "Багамы", "Италия", "Норвегия", "Бельгия", 1),
////                Question(33, "Какая страна принадлежит этому флагу?", R.drawable.bt, "Бутан", "Канада", "Бразилия", "Индия", 2),
////                Question(34, "Какая страна принадлежит этому флагу?", R.drawable.bv, "Бурунди", "Остров Буве", "Бангладеш", "Бельгия", 2),
////                Question(35, "Какая страна принадлежит этому флагу?", R.drawable.bw, "Ботсвана", "Камерун", "Бангладеш", "Египет", 1),
////                Question(36, "Какая страна принадлежит этому флагу?", R.drawable.by, "Польща", "Италия", "Беларусь", "Бельгия", 3),
////                Question(37, "Какая страна принадлежит этому флагу?", R.drawable.bz, "Австрия", "Белиз", "Бангладеш", "Босния и Герцеговина", 2),
//       ))
//        return questionsList
//    }
//#endregion

    fun getQuestions(): ArrayList<Question> {


        val questionsList = ArrayList<Question>()
        countriesCodes.shuffle()
        for ((index, countryCode) in countriesCodes.withIndex()) {
            val fourCountries = getFourCountries(countryCode)
            val flagCountryName = getCountryName(countryCode)
            val question = Question(
                index + 1,
                "Какая страна принадлежит этому флагу?",
                R.drawable::class.java.getDeclaredField(countryCode).getInt(null),
                fourCountries[0],
                fourCountries[1],
                fourCountries[2],
                fourCountries[3],
                fourCountries.indexOf(flagCountryName)+1
            )
            questionsList.add(question)
        }

        return questionsList
    }

    private fun getCountryName(code: String): String {
        return when (code) {
            "ad" -> "Андорра"
            "ae" -> "ОАЭ"
            "af" -> "Афганистан"
            "ag" -> "Антигуа и Барбуда"
            "ai" -> "Ангилья"
            "al" -> "Албания"
            "am" -> "Армения"
            "ao" -> "Ангола"
            "aq" -> "Антарктида"
            "ar" -> "Аргентина"
            "as" -> "Американское Самоа"
            "at" -> "Австрия"
            "au" -> "Австралия"
            "aw" -> "Аруба"
            "ax" -> "Аландские острова"
            "az" -> "Азербайджан"
            "ba" -> "Босния и Герцеговина"
            "bb" -> "Барбадос"
            "bd" -> "Бангладеш"
            "be" -> "Бельгия"
            "bf" -> "Буркина-Фасо"
            "bg" -> "Болгария"
            "bh" -> "Бахрейн"
            "bi" -> "Бурунди"
            "bj" -> "Бенин"
            "bl" -> "Сен-Бартельми"
            "bm" -> "Бермуды"
            "bn" -> "Бруней"
            "bo" -> "Боливия"
            "bq" -> "Карибские Нидерланды"
            "br" -> "Бразилия"
            "bs" -> "Багамы"
            "bt" -> "Бутан"
            "bv" -> "Остров Буве"
            "bw" -> "Ботсвана"
            "by" -> "Беларусь"
            "bz" -> "Белиз"
            "ca" -> "Канада"
            "cc" -> "Кокосовые острова"
            "cd" -> "Демократическая Республика Конго"
            "cf" -> "Центральноафриканская Республика"
            "cg" -> "Конго"
            "ch" -> "Швейцария"
            "ci" -> "Кот-д'Ивуар"
            "ck" -> "Острова Кука"
            "cl" -> "Чили"
            "cm" -> "Камерун"
            "cn" -> "Китай"
            "co" -> "Колумбия"
            "cr" -> "Коста-Рика"
            "cu" -> "Куба"
            "cv" -> "Кабо-Верде"
            "cw" -> "Кюрасао"
            "cx" -> "Остров Рождества"
            "cy" -> "Кипр"
            "cz" -> "Чехия"
            "de" -> "Германия"
            "dj" -> "Джибути"
            "dk" -> "Дания"
            "dm" -> "Доминика"
            "dom" -> "Доминиканская Республика"
            "dz" -> "Алжир"
            "ec" -> "Эквадор"
            "ee" -> "Эстония"
            "eg" -> "Египет"
            "eh" -> "Западная Сахара"
            "er" -> "Эритрея"
            "es" -> "Испания"
            "et" -> "Эфиопия"
            "fi" -> "Финляндия"
            "fj" -> "Фиджи"
            "fk" -> "Фолклендские острова"
            "fm" -> "Федеративные Штаты Микронезии"
            "fo" -> "Фарерские острова"
            "fr" -> "Франция"
            "ga" -> "Габон"
            "gb" -> "Великобритания"
            "gd" -> "Гренада"
            "ge" -> "Грузия"
            "gf" -> "Французская Гвиана"
            "gg" -> "Гернси"
            "gh" -> "Гана"
            "gi" -> "Гибралтар"
            "gl" -> "Гренландия"
            "gm" -> "Гамбия"
            "gn" -> "Гвинея"
            "gp" -> "Гваделупа"
            "gq" -> "Экваториальная Гвинея"
            "gr" -> "Греция"
            "gs" -> "Южная Георгия и Южные Сандвичевы острова"
            "gt" -> "Гватемала"
            "gu" -> "Гуам"
            "gw" -> "Гвинея-Бисау"
            "gy" -> "Гайана"
            "hk" -> "Гонконг"
            "hm" -> "Херд и Макдональд"
            "hn" -> "Гондурас"
            "hr" -> "Хорватия"
            "ht" -> "Гаити"
            "hu" -> "Венгрия"
            "id" -> "Индонезия"
            "ie" -> "Ирландия"
            "il" -> "Израиль"
            "im" -> "Остров Мэн"
            "in" -> "Индия"
            "io" -> "Британская территория в Индийском океане"
            "iq" -> "Ирак"
            "ir" -> "Иран"
            "is" -> "Исландия"
            "it" -> "Италия"
            "je" -> "Джерси"
            "jm" -> "Ямайка"
            "jo" -> "Иордания"
            "jp" -> "Япония"
            "ke" -> "Кения"
            "kg" -> "Киргизия"
            "kh" -> "Камбоджа"
            "ki" -> "Кирибати"
            "km" -> "Коморы"
            "kn" -> "Сент-Китс и Невис"
            "kp" -> "Северная Корея"
            "kr" -> "Южная Корея"
            "kw" -> "Кувейт"
            "ky" -> "Каймановы острова"
            "kz" -> "Казахстан"
            "la" -> "Лаос"
            "lb" -> "Ливан"
            "lc" -> "Сент-Люсия"
            "li" -> "Лихтенштейн"
            "lk" -> "Шри-Ланка"
            "lr" -> "Либерия"
            "ls" -> "Лесото"
            "lt" -> "Литва"
            "lu" -> "Люксембург"
            "lv" -> "Латвия"
            "ly" -> "Ливия"
            "ma" -> "Марокко"
            "mc" -> "Монако"
            "md" -> "Молдова"
            "me" -> "Черногория"
            "mf" -> "Сен-Мартен"
            "mg" -> "Мадагаскар"
            "mh" -> "Маршалловы острова"
            "mk" -> "Северная Македония"
            "ml" -> "Мали"
            "mm" -> "Мьянма"
            "mn" -> "Монголия"
            "mo" -> "Макао"
            "mp" -> "Северные Марианские острова"
            "mq" -> "Мартиника"
            "mr" -> "Мавритания"
            "ms" -> "Монтсеррат"
            "mt" -> "Мальта"
            "mu" -> "Маврикий"
            "mv" -> "Мальдивы"
            "mw" -> "Малави"
            "mx" -> "Мексика"
            "my" -> "Малайзия"
            "mz" -> "Мозамбик"
            "na" -> "Намибия"
            "nc" -> "Новая Каледония"
            "ne" -> "Нигер"
            "nf" -> "Остров Норфолк"
            "ng" -> "Нигерия"
            "ni" -> "Никарагуа"
            "nl" -> "Нидерланды"
            "no" -> "Норвегия"
            "np" -> "Непал"
            "nr" -> "Науру"
            "nu" -> "Ниуэ"
            "nz" -> "Новая Зеландия"
            "om" -> "Оман"
            "pa" -> "Панама"
            "pe" -> "Перу"
            "pf" -> "Французская Полинезия"
            "pg" -> "Папуа — Новая Гвинея"
            "ph" -> "Филиппины"
            "pk" -> "Пакистан"
            "pl" -> "Польша"
            "pm" -> "Сен-Пьер и Микелон"
            "pn" -> "Острова Питкэр"
            "pr" -> "Пуэрто-Рико"
            "ps" -> "Государство Палестина"
            "pt" -> "Португалия"
            "pw" -> "Палау"
            "py" -> "Парагвай"
            "qa" -> "Катар"
            "re" -> "Реюньон"
            "ro" -> "Румыния"
            "rs" -> "Сербия"
            "ru" -> "Россия"
            "rw" -> "Руанда"
            "sa" -> "Саудовская Аравия"
            "sb" -> "Соломоновы острова"
            "sc" -> "Сейшельские острова"
            "sd" -> "Судан"
            "se" -> "Швеция"
            "sg" -> "Сингапур"
            "sh" -> "Остров Святой Елены"
            "si" -> "Словения"
            "sj" -> "Шпицберген и Ян-Майен"
            "sk" -> "Словакия"
            "sl" -> "Сьерра-Леоне"
            "sm" -> "Сан-Марино"
            "sn" -> "Сенегал"
            "so" -> "Сомали"
            "sr" -> "Суринам"
            "ss" -> "Южный Судан"
            "st" -> "Сан-Томе и Принсипи"
            "sv" -> "Сальвадор"
            "sx" -> "Синт-Мартен"
            "sy" -> "Сирия"
            "sz" -> "Свазиленд"
            "tc" -> "Теркс и Кайкос"
            "td" -> "Чад"
            "tf" -> "Французские Южные территории"
            "tg" -> "Того"
            "th" -> "Таиланд"
            "tj" -> "Таджикистан"
            "tk" -> "Токелау"
            "tl" -> "Восточный Тимор"
            "tm" -> "Туркменистан"
            "tn" -> "Тунис"
            "to" -> "Тонга"
            "tr" -> "Турция"
            "tt" -> "Тринидад и Тобаго"
            "tv" -> "Тувалу"
            "tw" -> "Тайвань"
            "tz" -> "Танзания"
            "ua" -> "Украина"
            "ug" -> "Уганда"
            "um" -> "Внешние малые острова США"
            "us" -> "Соединенные Штаты Америки"
            "uy" -> "Уругвай"
            "uz" -> "Узбекистан"
            "va" -> "Ватикан"
            "vc" -> "Сент-Винсент и Гренадины"
            "ve" -> "Венесуэла"
            "vg" -> "Британские Виргинские острова"
            "vi" -> "Американские Виргинские острова"
            "vn" -> "Вьетнам"
            "vu" -> "Вануату"
            "wf" -> "Уоллис и Футуна"
            "ws" -> "Самоа"
            "xk" -> "Республика Косово"
            "ye" -> "Йемен"
            "yt" -> "Майотта"
            "za" -> "Южная Африка"
            "zm" -> "Замбия"
            "zw" -> "Зимбабве"
            else -> "Неизвестная страна"
        }
    }

    fun getFourCountries(code: String): ArrayList<String> {
        val countries = ArrayList<String>()
        countries.add(getCountryName(code))

        while (countries.size != 4) {
            val randomNum = (0 until countriesCodes.size).random()
            val randomCountryCode = countriesCodes[randomNum]
            val randomCountryName = getCountryName(randomCountryCode)
            if (!countries.contains(randomCountryName)) {
                countries.add(randomCountryName)
            }
        }
        countries.shuffle()
        return countries

    }

}